export const WORD_LIST = [
  'كتاب','علوم','نجوم','سماء','بحار',
  'جبال','قلوب','عقول','مدرس','طالب',
  'مسجد','بيوت','ورود','زهور','نخيل',
  'ذهاب','سفار','رحلة','طيار','كرسي',
  'دفتر','يلعب','يركض','يسبح','يطير',
  'أسرار','أحلام','آمال','أيام','قصيد',
  'معلم','مدير','وزير','أمير','حديد',
  'كوكب','نجمة','صلاة','زكاة','صيام',
]

export const VALID_GUESSES = [...WORD_LIST,
  'شعراء','أديب','كاتب','ملوك','فضاء',
  'حجاج','عمرة','أسود','أبيض','ليمون',
]

export function getRandomWord() {
  return WORD_LIST[Math.floor(Math.random() * WORD_LIST.length)]
}
